const equip = {
    冥玉惊魂刀: {
        type: '武器',
        物理攻击力: 787,
        力量: 50,
        暴击率: 5,
        暴击伤害: 60,
        力智加成: 22.5
    },
    绝灭之刃: {
        type: '武器',
        物理攻击力: 787,
        力量: 50,
        暴击率: 5,
        白字: 50,
        力智加成: 7
    },
    极皇: {
        type: '武器',
        物理攻击力: 791,
        力量: 75,
        暴击率: 5,
        白字: 30,
        黄字: 40
    },
    巨象: {
        type: '武器',
        物理攻击力: 791,
        力量: 50,
        暴击: 133,
        暴击率: 5,
        力智加成: 45,
        黄字: 12
    },
    英雄的荣耀: {
        type: '武器',
        物理攻击力: 857,
        力量: 273,
        暴击率: 2,
        白字: 50,
    },
    无轩: {
        type: '武器',
        物理攻击力: 791,
        力量: 50,
        暴击: 143,
        暴击率: 5,
        白字: 33,
        攻击力百分比: 20,
    },
    凯丽的念影左轮: {
        type: '武器',
        物理攻击力: 812,
        力量: 50,
        暴击率: 4,
        属强: 50,
        暴击伤害: 25,
        白字: 10.8,
    },
    双刃左轮: {
        type: '武器',
        物理攻击力: 812,
        力量: 50,
        暴击: 75,
        暴击伤害: 23,
        黄字: 35,
    },
    斗者之护符: {
        type: '护符',
        力量: 29,
        智力: 29,
        黄字: 5,
        力智加成: 5,
        白字: 5,
    },
    布万加: {
        type: '护符',
        力量: 394,
        智力: 394,
    },
    团魂骨: {
        type: '首饰',
        力量: 29 + 31,
        智力: 30 + 31,
        力智加成: 10,
        攻击力百分比: 30,
        黄字: 50,
        暴击: -46,
        属强: -8,
    },
    波动: {
        type: '首饰',
        力量: 30 + 45,
        智力: 30 + 45,
        属强: 7,
        暴击伤害: 13,
        暴击: 120,
        攻击力百分比: 18,
        技能攻击力: 25,
    },
    黎明: {
        type: '首饰',
        力量: 30 + 45,
        智力: 30 + 45,
        属强: 60,
        白字: 12,
        技能攻击力: 22,
        其它: -0.5,
    },
    审判者: {
        type: '首饰',
        力量: 30 + 45,
        智力: 30 + 45,
        属强: 40,
        力智加成: 10,
        攻击力百分比: 3,
        白字: 11,
        技能攻击力: 17,
    },
    克罗姆: {
        type: '防具-轻甲',
        力量: 36 + 29 + 36 + 22 + 22 + 250,
        智力: 24 + 19 + 24 + 14 + 14 + 250,
        黄字: 8 + 12 + 5 + 7 + 7 + 25,
        技能攻击力: 21,
        暴击: 220,
    },
    千钧之羽: {
        type: '防具-轻甲',
        力量: 36 + 29 + 36 + 22 + 22,
        智力: 24 + 19 + 24 + 14 + 14,
        力智加成: 8,
        黄字: 10 + 14 + 10 + 8 + 33,
        技能攻击力: 11,
        属强: 15,
    },
    达丽雅: {
        type: '防具-轻甲',
        力量: 36 + 29 + 36 + 22 + 22,
        智力: 24 + 19 + 24 + 14 + 14,
        攻击力百分比: 10 + 10,
        力智加成: 24,
        白字: 8 + 12 + 8,
        技能攻击力: 1.06 * 1.1 * 100 - 100,
    },
    深海: {
        type: '防具-重甲',
        力量: 33 + 26 + 33 + 17 + 129,
        智力: 24 + 19 + 24 + 14 + 14,
        黄字: 10,
        白字: 9 + 7 + 6 + 4 + 4 + 45,
        技能攻击力: 10,
        暴击: 100,
        其它: 5,
    },
    潜行者: {
        type: '防具-皮甲',
        力量: 30 + 24 + 30 + 18 + 18,
        智力: 30 + 24 + 30 + 18 + 18,
        黄字: 8 + 5 + 5,
        技能攻击力: 13,
        暴击: 100 + 50 + 50 + 50,
        暴击伤害: 40 + 5 + 18 + 5 + 10 + 10,
    },
    火焰赫瑞克: {
        type: '防具-皮甲',
        力量: 30 + 24 + 30 + 18 + 18,
        智力: 30 + 24 + 30 + 18 + 18,
        黄字: 8 + 7,
        技能攻击力: 11,
        暴击: 275,
        攻击力百分比: 10,
        力智加成: 7,
        白字: 38,
    }

}

const person = {
    剑宗: {
        攻击力百分比: 18.2,
        暴击率: 6.5,
        暴击伤害: 23,
        技能攻击力: 21,
        精通: '轻甲',
    },
    狂战: {
        攻击力百分比: 31,
        暴击率: 12,
        力量: 215,
        技能攻击力: 10,
        精通: '重甲',
    },
    武神: {
        暴击率: 15,
        力量: 144,
        暴击伤害: 5,
        技能攻击力: 25,
        精通: '轻甲',
    },
    剑豪: {
        攻击力百分比: 18.2,
        技能攻击力: 21,
        精通: '皮甲',
    },
    漫游: {
        暴击伤害: 27,
        技能攻击力: 32,
        暴击率: 5.5 + 5,
        精通: '皮甲',
    }
}
const base = {
    物理攻击力: 819,
    魔法攻击力: 819,
    独立攻击力: 600,
    攻击加成: 8,
    力量: 3079,
    智力: 3079,
    力智加成: 0,
    黄字: 31,
    白字: 21,
    属强: 178,//178
    属白: 0,
    暴击: 922,//922
    暴击率: 14,
    暴伤: 50,
    技攻: 0,
    其它: 0,
}
const baseTags = [
    {
        name: '剑宗',
        type: '职业-物理',
        精通: '轻甲',
        精通加成: [{ name: '力量', value: 123 },],
        被动: [
            { name: '攻击加成', value: 18.2 },
            { name: '暴击率', value: 6.5 },
            { name: '暴伤', value: 23 },
            { name: '技攻', value: 21 },
        ]
    },
    {
        name: '冥玉惊魂刀',
        type: '武器',
        被动: [
            { name: '物理攻击力', value: 787 },
            { name: '魔法攻击力', value: 787 },
            { name: '力量', value: 50 },
            { name: '暴击率', value: 5 },
            { name: '暴伤', value: 60 },
            { name: '力智加成', value: 60 },
        ]
    },
    {
        name: '克罗姆',
        type: '防具-轻甲',
        被动: [
            { name: '力量', value: 36 + 29 + 36 + 22 + 22 + 250 },
            { name: '智力', value: 24 + 19 + 24 + 14 + 14 + 250 },
            { name: '黄字', value: 8 + 12 + 5 + 7 + 7 + 25 },
            { name: '技攻', value: 21 },
            { name: '暴击', value: 220 },
        ]
    },
    {
        name: '团魂骨',
        type: '首饰',
        被动: [
            { name: '力量', value: 29 + 31 },
            { name: '智力', value: 30 + 31 },
            { name: '力智加成', value: 10 },
            { name: '攻击加成', value: 30 },
            { name: '黄字', value: 50 },
            { name: '暴击', value: -46 },
            { name: '属强', value: -8 },
        ]
    },

    {
        name: '黎明',
        type: '首饰',
        被动: [
            { name: '力量', value: 30 + 45 },
            { name: '智力', value: 30 + 45 },
            { name: '属强', value: 60 },
            { name: '属白', value: 10 },
            { name: '技攻', value: 22 },
            { name: '其它', value: 0.5 },

        ]
    },
    {
        name: '布万加',
        type: '护符',
        被动: [
            { name: '力量', value: 396 },
            { name: '智力', value: 396 },

        ]
    },
]
export { base, baseTags }